yenchouRJ/nuc990_non-os/Library/StdDriver/inc/sys.h
#define SYS_GPB_MFPL_PB5MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_EBI_ADDR16        (0x01UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_I2C2_SCL          (0x02UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_I2S_DO            (0x03UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_CAN5_TXD          (0x04UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_UART7_nRTS        (0x05UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_SPI1_MISO         (0x06UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_ADC0_CH5          (0x08UL<<SYS_GPB_MFPL_PB5MFP_Pos)

#define SYS_GPB_MFPL_PB6MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_EBI_ADDR13        (0x01UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_I2C1_SDA          (0x02UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_I2S_LRCK          (0x03UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_CAN4_RXD          (0x04UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_UART7_TXD         (0x05UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_SPI1_SS0          (0x06UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_ADC0_CH6          (0x08UL<<SYS_GPB_MFPL_PB6MFP_Pos)

#define SYS_GPB_MFPL_PB7MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_EBI_ADDR15        (0x01UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_I2C2_SDA          (0x02UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_I2S_DI            (0x03UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_CAN5_RXD          (0x04UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_UART7_nCTS        (0x05UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_SPI1_MOSI         (0x06UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_ADC0_CH7          (0x08UL<<SYS_GPB_MFPL_PB7MFP_Pos)

/********************* Bit definition of GPB_MFPH register **********************/
#define SYS_GPB_MFPH_PB8MFP_GPIO              (0x00UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_EBI_ADDR11        (0x01UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_I2C2_SCL          (0x02UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_CAN2_RXD          (0x03UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_UART8_TXD         (0x04UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_UART9_nCTS        (0x05UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_SD0_nCD           (0x06UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_TM0_EXT           (0x07UL<<SYS_GPB_MFPH_PB8MFP_Pos)

#define SYS_GPB_MFPH_PB9MFP_GPIO              (0x00UL<<SYS_GPB_MFPH_PB9MFP_Pos)
#define SYS_GPB_MFPH_PB9MFP_UART3_TXD         (0x01UL<<SYS_GPB_MFPH_PB9MFP_Pos)
#define SYS_GPB_MFPH_PB9MFP_BPWM1_CH3         (0x02UL<<SYS_GPB_MFPH_PB9MFP_Pos)
#define SYS_GPB_MFPH_PB9MFP_TM0               (0x03UL<<SYS_GPB_MFPH_PB9MFP_Pos)
#define SYS_GPB_MFPH_PB9MFP_CANFD0_RXD        (0x04UL<<SYS_GPB_MFPH_PB9MFP_Pos)
#define SYS_GPB_MFPH_PB9MFP_SPI1_SS0          (0x05UL<<SYS_GPB_MFPH_PB9MFP_Pos)
#define SYS_GPB_MFPH_PB9MFP_SD1_DATA0         (0x06UL<<SYS_GPB_MFPH_PB9MFP_Pos)
#define SYS_GPB_MFPH_PB9MFP_eMMC1_DATA0       (0x06UL<<SYS_GPB_MFPH_PB9MFP_Pos)

#define SYS_GPB_MFPH_PB10MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB10MFP_Pos)
#define SYS_GPB_MFPH_PB10MFP_UART3_RXD        (0x01UL<<SYS_GPB_MFPH_PB10MFP_Pos)
#define SYS_GPB_MFPH_PB10MFP_BPWM1_CH2        (0x02UL<<SYS_GPB_MFPH_PB10MFP_Pos)
#define SYS_GPB_MFPH_PB10MFP_TM0_EXT          (0x03UL<<SYS_GPB_MFPH_PB10MFP_Pos)
#define SYS_GPB_MFPH_PB10MFP_CANFD0_TXD       (0x04UL<<SYS_GPB_MFPH_PB10MFP_Pos)
#define SYS_GPB_MFPH_PB10MFP_SPI1_CLK         (0x05UL<<SYS_GPB_MFPH_PB10MFP_Pos)
#define SYS_GPB_MFPH_PB10MFP_SD1_DATA1        (0x06UL<<SYS_GPB_MFPH_PB10MFP_Pos)
#define SYS_GPB_MFPH_PB10MFP_eMMC1_DATA1      (0x06UL<<SYS_GPB_MFPH_PB10MFP_Pos)

#define SYS_GPB_MFPH_PB11MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_UART3_nRTS       (0x01UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_BPWM1_CH1        (0x02UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_TM2_EXT          (0x03UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_CANFD1_RXD       (0x04UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_SPI1_MOSI        (0x05UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_SD1_DATA2        (0x06UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_eMMC1_DATA2      (0x06UL<<SYS_GPB_MFPH_PB11MFP_Pos)
#define SYS_GPB_MFPH_PB11MFP_I2C3_SMBAL       (0x08UL<<SYS_GPB_MFPH_PB11MFP_Pos)

#define SYS_GPB_MFPH_PB12MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_UART3_nCTS       (0x01UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_BPWM1_CH0        (0x02UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_TM2              (0x03UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_CANFD1_TXD       (0x04UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_SPI1_MISO        (0x05UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_SD1_DATA3        (0x06UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_eMMC1_DATA3      (0x06UL<<SYS_GPB_MFPH_PB12MFP_Pos)
#define SYS_GPB_MFPH_PB12MFP_I2C3_SMBSUS      (0x08UL<<SYS_GPB_MFPH_PB12MFP_Pos)

#define SYS_GPB_MFPH_PB13MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB13MFP_Pos)
#define SYS_GPB_MFPH_PB13MFP_EMAC1_RMII_PPS   (0x01UL<<SYS_GPB_MFPH_PB13MFP_Pos)
#define SYS_GPB_MFPH_PB13MFP_INT2             (0x02UL<<SYS_GPB_MFPH_PB13MFP_Pos)
#define SYS_GPB_MFPH_PB13MFP_TM4              (0x03UL<<SYS_GPB_MFPH_PB13MFP_Pos)
#define SYS_GPB_MFPH_PB13MFP_BPWM0_CH2        (0x04UL<<SYS_GPB_MFPH_PB13MFP_Pos)
#define SYS_GPB_MFPH_PB13MFP_UART3_TXD        (0x05UL<<SYS_GPB_MFPH_PB13MFP_Pos)
#define SYS_GPB_MFPH_PB13MFP_SPI2_SS1         (0x07UL<<SYS_GPB_MFPH_PB13MFP_Pos)
#define SYS_GPB_MFPH_PB13MFP_EBI_AD0          (0x08UL<<SYS_GPB_MFPH_PB13MFP_Pos)

/********************* Bit definition of GPC_MFPL register **********************/
#define SYS_GPC_MFPL_PC0MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_EBI_AD0           (0x01UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_I2C2_SDA          (0x02UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_CAN2_TXD          (0x03UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_UART8_RXD         (0x04UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_SPI0_SS1          (0x05UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_TM0               (0x07UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_SPI3_SS0          (0x08UL<<SYS_GPC_MFPL_PC0MFP_Pos)

