yenchouRJ/nuc990_non-os/Library/StdDriver/inc/sys.h
#define SYS_GPC_MFPL_PC1MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC1MFP_Pos)
#define SYS_GPC_MFPL_PC1MFP_EBI_AD1           (0x01UL<<SYS_GPC_MFPL_PC1MFP_Pos)
#define SYS_GPC_MFPL_PC1MFP_CAN6_RXD          (0x02UL<<SYS_GPC_MFPL_PC1MFP_Pos)
#define SYS_GPC_MFPL_PC1MFP_NAND_nCS          (0x03UL<<SYS_GPC_MFPL_PC1MFP_Pos)
#define SYS_GPC_MFPL_PC1MFP_UART7_TXD         (0x04UL<<SYS_GPC_MFPL_PC1MFP_Pos)
#define SYS_GPC_MFPL_PC1MFP_UART3_nCTS        (0x05UL<<SYS_GPC_MFPL_PC1MFP_Pos)
#define SYS_GPC_MFPL_PC1MFP_SPI3_CLK          (0x08UL<<SYS_GPC_MFPL_PC1MFP_Pos)

#define SYS_GPC_MFPL_PC2MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC2MFP_Pos)
#define SYS_GPC_MFPL_PC2MFP_EBI_AD2           (0x01UL<<SYS_GPC_MFPL_PC2MFP_Pos)
#define SYS_GPC_MFPL_PC2MFP_CAN6_TXD          (0x02UL<<SYS_GPC_MFPL_PC2MFP_Pos)
#define SYS_GPC_MFPL_PC2MFP_NAND_nWP          (0x03UL<<SYS_GPC_MFPL_PC2MFP_Pos)
#define SYS_GPC_MFPL_PC2MFP_UART7_RXD         (0x04UL<<SYS_GPC_MFPL_PC2MFP_Pos)
#define SYS_GPC_MFPL_PC2MFP_UART3_nRTS        (0x05UL<<SYS_GPC_MFPL_PC2MFP_Pos)
#define SYS_GPC_MFPL_PC2MFP_SPI3_MOSI         (0x08UL<<SYS_GPC_MFPL_PC2MFP_Pos)

#define SYS_GPC_MFPL_PC3MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC3MFP_Pos)
#define SYS_GPC_MFPL_PC3MFP_EBI_AD3           (0x01UL<<SYS_GPC_MFPL_PC3MFP_Pos)
#define SYS_GPC_MFPL_PC3MFP_NAND_ALE          (0x03UL<<SYS_GPC_MFPL_PC3MFP_Pos)
#define SYS_GPC_MFPL_PC3MFP_I2C1_SCL          (0x04UL<<SYS_GPC_MFPL_PC3MFP_Pos)
#define SYS_GPC_MFPL_PC3MFP_UART3_TXD         (0x05UL<<SYS_GPC_MFPL_PC3MFP_Pos)
#define SYS_GPC_MFPL_PC3MFP_CAN0_RXD          (0x07UL<<SYS_GPC_MFPL_PC3MFP_Pos)
#define SYS_GPC_MFPL_PC3MFP_SPI3_MISO         (0x08UL<<SYS_GPC_MFPL_PC3MFP_Pos)

#define SYS_GPC_MFPL_PC4MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC4MFP_Pos)
#define SYS_GPC_MFPL_PC4MFP_EBI_AD4           (0x01UL<<SYS_GPC_MFPL_PC4MFP_Pos)
#define SYS_GPC_MFPL_PC4MFP_NAND_CLE          (0x03UL<<SYS_GPC_MFPL_PC4MFP_Pos)
#define SYS_GPC_MFPL_PC4MFP_I2C1_SDA          (0x04UL<<SYS_GPC_MFPL_PC4MFP_Pos)
#define SYS_GPC_MFPL_PC4MFP_UART3_RXD         (0x05UL<<SYS_GPC_MFPL_PC4MFP_Pos)
#define SYS_GPC_MFPL_PC4MFP_SPI0_MOSI         (0x06UL<<SYS_GPC_MFPL_PC4MFP_Pos)
#define SYS_GPC_MFPL_PC4MFP_CAN0_TXD          (0x07UL<<SYS_GPC_MFPL_PC4MFP_Pos)

#define SYS_GPC_MFPL_PC5MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_EBI_AD5           (0x01UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_CAN7_RXD          (0x02UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_NAND_nWE          (0x03UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_SPI0_SS0          (0x05UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_SD0_CMD           (0x06UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_eMMC0_CMD         (0x06UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_UART1_TXD         (0x07UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_UART7_nCTS        (0x08UL<<SYS_GPC_MFPL_PC5MFP_Pos)

#define SYS_GPC_MFPL_PC6MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_EBI_AD6           (0x01UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_CAN7_TXD          (0x02UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_NAND_nRE          (0x03UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_SC1_RST           (0x04UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_SPI0_CLK          (0x05UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_SD0_CLK           (0x06UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_eMMC0_CLK         (0x06UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_UART1_RXD         (0x07UL<<SYS_GPC_MFPL_PC6MFP_Pos)

#define SYS_GPC_MFPL_PC7MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_EBI_AD7           (0x01UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_CANFD3_TXD        (0x02UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_NAND_RDY          (0x03UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_SC1_CLK           (0x04UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_SPI0_MOSI         (0x05UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_SD0_DATA0         (0x06UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_eMMC0_DATA0       (0x06UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_UART1_nRTS        (0x07UL<<SYS_GPC_MFPL_PC7MFP_Pos)

/********************* Bit definition of GPC_MFPH register **********************/
#define SYS_GPC_MFPH_PC8MFP_GPIO              (0x00UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPH_PC8MFP_EBI_AD8           (0x01UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPL_PC8MFP_CANFD2_RXD        (0x02UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPL_PC8MFP_NAND_DATA0        (0x03UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPL_PC8MFP_SC1_DAT           (0x04UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPL_PC8MFP_SPI0_MISO         (0x05UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPL_PC8MFP_SD0_DATA1         (0x06UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPL_PC8MFP_eMMC0_DATA1       (0x06UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPL_PC8MFP_UART1_nCTS        (0x07UL<<SYS_GPC_MFPH_PC8MFP_Pos)

#define SYS_GPC_MFPH_PC9MFP_GPIO              (0x00UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPH_PC9MFP_EBI_AD9           (0x01UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPL_PC9MFP_CANFD2_TXD        (0x02UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPL_PC9MFP_NAND_DATA1        (0x03UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPL_PC9MFP_SC1_PWR           (0x04UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPL_PC9MFP_I2C0_SMBAL        (0x05UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPL_PC9MFP_SD0_DATA2         (0x06UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPL_PC9MFP_eMMC0_DATA2       (0x06UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPL_PC9MFP_UART4_TXD         (0x07UL<<SYS_GPC_MFPH_PC9MFP_Pos)

#define SYS_GPC_MFPH_PC10MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPH_PC10MFP_EBI_AD10         (0x01UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_CANFD3_RXD       (0x02UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_NAND_DATA2       (0x03UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_SC1_nCD          (0x04UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_I2C0_SMBSUS      (0x05UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_SD0_DATA3        (0x06UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_eMMC0_DATA3      (0x06UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_UART4_RXD        (0x07UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPL_PC10MFP_SPI3_SS0         (0x08UL<<SYS_GPC_MFPH_PC10MFP_Pos)

#define SYS_GPC_MFPH_PC11MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPH_PC11MFP_EBI_AD11         (0x01UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPL_PC11MFP_CANFD3_TXD       (0x02UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPL_PC11MFP_NAND_DATA3       (0x03UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPL_PC11MFP_SC0_RST          (0x04UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPL_PC11MFP_I2C1_SMBAL       (0x05UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPL_PC11MFP_UART7_nRTS       (0x07UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPL_PC11MFP_SPI3_CLK         (0x08UL<<SYS_GPC_MFPH_PC11MFP_Pos)

#define SYS_GPC_MFPH_PC12MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPH_PC12MFP_EBI_AD12         (0x01UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPL_PC12MFP_CANFD0_RXD       (0x02UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPL_PC12MFP_NAND_DATA4       (0x03UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPL_PC12MFP_SC0_CLK          (0x04UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPL_PC12MFP_CAN4_RXD         (0x05UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPL_PC12MFP_SD0_nCD          (0x06UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPL_PC12MFP_UART8_TXD        (0x07UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPL_PC12MFP_SPI3_MOSI        (0x08UL<<SYS_GPC_MFPH_PC12MFP_Pos)

#define SYS_GPC_MFPH_PC13MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPH_PC13MFP_EBI_AD13         (0x01UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPL_PC13MFP_CANFD0_TXD       (0x02UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPL_PC13MFP_NAND_DATA5       (0x03UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPL_PC13MFP_SC0_DAT          (0x04UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPL_PC13MFP_CAN4_TXD         (0x05UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPL_PC13MFP_UART8_RXD        (0x07UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPL_PC13MFP_SPI3_MISO        (0x08UL<<SYS_GPC_MFPH_PC13MFP_Pos)

#define SYS_GPC_MFPH_PC14MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPH_PC14MFP_EBI_AD14         (0x01UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPL_PC14MFP_CANFD1_RXD       (0x02UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPL_PC14MFP_NAND_DATA6       (0x03UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPL_PC14MFP_SC0_PWR          (0x04UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPL_PC14MFP_SPI0_MOSI        (0x05UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPL_PC14MFP_CAN5_RXD         (0x06UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPL_PC14MFP_UART8_nRTS       (0x07UL<<SYS_GPC_MFPH_PC14MFP_Pos)

#define SYS_GPC_MFPH_PC15MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPH_PC15MFP_EBI_AD15         (0x01UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPL_PC15MFP_CANFD1_TXD       (0x02UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPL_PC15MFP_NAND_DATA7       (0x03UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPL_PC15MFP_SC0_nCD          (0x04UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPL_PC15MFP_I2C1_SMBSUS      (0x05UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPL_PC15MFP_CAN5_TXD         (0x06UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPL_PC15MFP_UART8_nCTS       (0x07UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPC_MFPL_PC15MFP_SPI3_SS1         (0x08UL<<SYS_GPC_MFPH_PC15MFP_Pos)

/********************* Bit definition of GPD_MFPL register **********************/
#define SYS_GPD_MFPL_PD0MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD0MFP_Pos)
#define SYS_GPD_MFPL_PD0MFP_QSPI0_SS1         (0x01UL<<SYS_GPD_MFPL_PD0MFP_Pos)
#define SYS_GPD_MFPL_PD0MFP_UART5_TXD         (0x02UL<<SYS_GPD_MFPL_PD0MFP_Pos)
#define SYS_GPD_MFPL_PD0MFP_TM1               (0x03UL<<SYS_GPD_MFPL_PD0MFP_Pos)
#define SYS_GPD_MFPL_PD0MFP_INT2              (0x04UL<<SYS_GPD_MFPL_PD0MFP_Pos)
#define SYS_GPD_MFPL_PD0MFP_CANFD2_RXD        (0x06UL<<SYS_GPD_MFPL_PD0MFP_Pos)
#define SYS_GPD_MFPL_PD0MFP_SPI2_SS0          (0x07UL<<SYS_GPD_MFPL_PD0MFP_Pos)
#define SYS_GPD_MFPL_PD0MFP_I2C2_SMBAL        (0x08UL<<SYS_GPD_MFPL_PD0MFP_Pos)

#define SYS_GPD_MFPL_PD1MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD1MFP_Pos)
#define SYS_GPD_MFPL_PD1MFP_SPI0_SS1          (0x01UL<<SYS_GPD_MFPL_PD1MFP_Pos)
#define SYS_GPD_MFPL_PD1MFP_UART5_RXD         (0x02UL<<SYS_GPD_MFPL_PD1MFP_Pos)
#define SYS_GPD_MFPL_PD1MFP_TM1_EXT           (0x03UL<<SYS_GPD_MFPL_PD1MFP_Pos)
#define SYS_GPD_MFPL_PD1MFP_INT3              (0x04UL<<SYS_GPD_MFPL_PD1MFP_Pos)
#define SYS_GPD_MFPL_PD1MFP_CANFD2_TXD        (0x06UL<<SYS_GPD_MFPL_PD1MFP_Pos)
#define SYS_GPD_MFPL_PD1MFP_I2C2_SMBSUS       (0x08UL<<SYS_GPD_MFPL_PD1MFP_Pos)

#define SYS_GPD_MFPL_PD2MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD2MFP_Pos)
#define SYS_GPD_MFPL_PD2MFP_QSPI0_SS0         (0x01UL<<SYS_GPD_MFPL_PD2MFP_Pos)
#define SYS_GPD_MFPL_PD2MFP_UART3_TXD         (0x02UL<<SYS_GPD_MFPL_PD2MFP_Pos)
#define SYS_GPD_MFPL_PD2MFP_TM4_EXT           (0x03UL<<SYS_GPD_MFPL_PD2MFP_Pos)
#define SYS_GPD_MFPL_PD2MFP_CAN7_RXD          (0x06UL<<SYS_GPD_MFPL_PD2MFP_Pos)

#define SYS_GPD_MFPL_PD3MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD3MFP_Pos)
#define SYS_GPD_MFPL_PD3MFP_QSPI0_CLK         (0x01UL<<SYS_GPD_MFPL_PD3MFP_Pos)
#define SYS_GPD_MFPL_PD3MFP_UART3_RXD         (0x02UL<<SYS_GPD_MFPL_PD3MFP_Pos)
#define SYS_GPD_MFPL_PD3MFP_TM4               (0x03UL<<SYS_GPD_MFPL_PD3MFP_Pos)
#define SYS_GPD_MFPL_PD3MFP_CAN7_TXD          (0x06UL<<SYS_GPD_MFPL_PD3MFP_Pos)

#define SYS_GPD_MFPL_PD4MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD4MFP_Pos)
#define SYS_GPD_MFPL_PD4MFP_QSPI0_MOSI0       (0x01UL<<SYS_GPD_MFPL_PD4MFP_Pos)
#define SYS_GPD_MFPL_PD4MFP_UART3_nRTS        (0x02UL<<SYS_GPD_MFPL_PD4MFP_Pos)
#define SYS_GPD_MFPL_PD4MFP_TM5_EXT           (0x03UL<<SYS_GPD_MFPL_PD4MFP_Pos)
#define SYS_GPD_MFPL_PD4MFP_CANFD2_RXD        (0x06UL<<SYS_GPD_MFPL_PD4MFP_Pos)

#define SYS_GPD_MFPL_PD5MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD5MFP_Pos)
#define SYS_GPD_MFPL_PD5MFP_QSPI0_MISO0       (0x01UL<<SYS_GPD_MFPL_PD5MFP_Pos)
#define SYS_GPD_MFPL_PD5MFP_UART3_nCTS        (0x02UL<<SYS_GPD_MFPL_PD5MFP_Pos)
#define SYS_GPD_MFPL_PD5MFP_TM5               (0x03UL<<SYS_GPD_MFPL_PD5MFP_Pos)
#define SYS_GPD_MFPL_PD5MFP_CANFD2_TXD        (0x06UL<<SYS_GPD_MFPL_PD5MFP_Pos)

#define SYS_GPD_MFPL_PD6MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD6MFP_Pos)
#define SYS_GPD_MFPL_PD6MFP_QSPI0_MOSI1       (0x01UL<<SYS_GPD_MFPL_PD6MFP_Pos)
#define SYS_GPD_MFPL_PD6MFP_UART2_TXD         (0x02UL<<SYS_GPD_MFPL_PD6MFP_Pos)
#define SYS_GPD_MFPL_PD6MFP_CAN0_RXD          (0x04UL<<SYS_GPD_MFPL_PD6MFP_Pos)

#define SYS_GPD_MFPL_PD7MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD7MFP_Pos)
#define SYS_GPD_MFPL_PD7MFP_QSPI0_MISO1       (0x01UL<<SYS_GPD_MFPL_PD7MFP_Pos)
#define SYS_GPD_MFPL_PD7MFP_UART2_RXD         (0x02UL<<SYS_GPD_MFPL_PD7MFP_Pos)
#define SYS_GPD_MFPL_PD7MFP_CAN0_TXD          (0x04UL<<SYS_GPD_MFPL_PD7MFP_Pos)

/********************* Bit definition of GPD_MFPH register **********************/
#define SYS_GPD_MFPH_PD8MFP_GPIO              (0x00UL<<SYS_GPD_MFPH_PD8MFP_Pos)
#define SYS_GPD_MFPH_PD8MFP_SPI0_SS0          (0x01UL<<SYS_GPD_MFPH_PD8MFP_Pos)
#define SYS_GPD_MFPH_PD8MFP_UART6_nCTS        (0x02UL<<SYS_GPD_MFPH_PD8MFP_Pos)
#define SYS_GPD_MFPH_PD8MFP_CAN4_RXD          (0x03UL<<SYS_GPD_MFPH_PD8MFP_Pos)
#define SYS_GPD_MFPH_PD8MFP_I2C0_SMBAL        (0x05UL<<SYS_GPD_MFPH_PD8MFP_Pos)
#define SYS_GPD_MFPH_PD8MFP_BPWM1_CH5         (0x06UL<<SYS_GPD_MFPH_PD8MFP_Pos)

#define SYS_GPD_MFPH_PD9MFP_GPIO              (0x00UL<<SYS_GPD_MFPH_PD9MFP_Pos)
#define SYS_GPD_MFPH_PD9MFP_SPI0_CLK          (0x01UL<<SYS_GPD_MFPH_PD9MFP_Pos)
#define SYS_GPD_MFPH_PD9MFP_UART6_nRTS        (0x02UL<<SYS_GPD_MFPH_PD9MFP_Pos)
#define SYS_GPD_MFPH_PD9MFP_CAN4_TXD          (0x03UL<<SYS_GPD_MFPH_PD9MFP_Pos)
#define SYS_GPD_MFPH_PD9MFP_I2C0_SMBSUS       (0x05UL<<SYS_GPD_MFPH_PD9MFP_Pos)
#define SYS_GPD_MFPH_PD9MFP_BPWM1_CH4         (0x06UL<<SYS_GPD_MFPH_PD9MFP_Pos)

#define SYS_GPD_MFPH_PD10MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD10MFP_Pos)
#define SYS_GPD_MFPH_PD10MFP_SPI0_MOSI        (0x01UL<<SYS_GPD_MFPH_PD10MFP_Pos)
#define SYS_GPD_MFPH_PD10MFP_UART6_TXD        (0x02UL<<SYS_GPD_MFPH_PD10MFP_Pos)
#define SYS_GPD_MFPH_PD10MFP_CAN5_RXD         (0x03UL<<SYS_GPD_MFPH_PD10MFP_Pos)
#define SYS_GPD_MFPH_PD10MFP_I2C1_SMBAL       (0x05UL<<SYS_GPD_MFPH_PD10MFP_Pos)
#define SYS_GPD_MFPH_PD10MFP_BPWM0_CH5        (0x06UL<<SYS_GPD_MFPH_PD10MFP_Pos)

#define SYS_GPD_MFPH_PD11MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD11MFP_Pos)
#define SYS_GPD_MFPH_PD11MFP_SPI0_MISO        (0x01UL<<SYS_GPD_MFPH_PD11MFP_Pos)
#define SYS_GPD_MFPH_PD11MFP_UART6_RXD        (0x02UL<<SYS_GPD_MFPH_PD11MFP_Pos)
#define SYS_GPD_MFPH_PD11MFP_CAN5_TXD         (0x03UL<<SYS_GPD_MFPH_PD11MFP_Pos)
#define SYS_GPD_MFPH_PD11MFP_I2C1_SMBSUS      (0x05UL<<SYS_GPD_MFPH_PD11MFP_Pos)
#define SYS_GPD_MFPH_PD11MFP_BPWM0_CH4        (0x06UL<<SYS_GPD_MFPH_PD11MFP_Pos)

#define SYS_GPD_MFPH_PD12MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_UART4_TXD        (0x01UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_TM2              (0x02UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_CAN2_RXD         (0x04UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_I2C3_SMBAL       (0x05UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_BPWM0_CH0        (0x06UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_SPI2_SS1         (0x07UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_EBI_AD1          (0x08UL<<SYS_GPD_MFPH_PD12MFP_Pos)

#define SYS_GPD_MFPH_PD13MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_UART4_RXD        (0x01UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_TM2_EXT          (0x02UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_CAN2_TXD         (0x04UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_I2C3_SMBSUS      (0x05UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_BPWM0_CH1        (0x06UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_SPI2_CLK         (0x07UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_EBI_AD2          (0x08UL<<SYS_GPD_MFPH_PD13MFP_Pos)

#define SYS_GPD_MFPH_PD14MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_UART4_nRTS       (0x01UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_TM3              (0x02UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_I2C3_SCL         (0x03UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_CAN1_RXD         (0x04UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_BPWM0_CH2        (0x06UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_SPI2_MOSI        (0x07UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_EBI_AD3          (0x08UL<<SYS_GPD_MFPH_PD14MFP_Pos)

#define SYS_GPD_MFPH_PD15MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_UART4_nCTS       (0x01UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_TM3_EXT          (0x02UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_I2C3_SDA         (0x03UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_CAN1_TXD         (0x04UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_BPWM0_CH3        (0x06UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_SPI2_MISO        (0x07UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_EBI_AD4          (0x08UL<<SYS_GPD_MFPH_PD15MFP_Pos)

