yenchouRJ/nuc990_non-os/Library/StdDriver/inc/sys.h
/********************* Bit definition of GPE_MFPL register **********************/
#define SYS_GPE_MFPL_PE0MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE0MFP_Pos)
#define SYS_GPE_MFPL_PE0MFP_EMAC0_RMII_RXERR  (0x01UL<<SYS_GPE_MFPL_PE0MFP_Pos)
#define SYS_GPE_MFPL_PE0MFP_CAN0_RXD          (0x02UL<<SYS_GPE_MFPL_PE0MFP_Pos)
#define SYS_GPE_MFPL_PE0MFP_UART4_nCTS        (0x05UL<<SYS_GPE_MFPL_PE0MFP_Pos)
#define SYS_GPE_MFPL_PE0MFP_SPI3_SS1          (0x06UL<<SYS_GPE_MFPL_PE0MFP_Pos)
#define SYS_GPE_MFPL_PE0MFP_I2C2_SMBAL        (0x07UL<<SYS_GPE_MFPL_PE0MFP_Pos)

#define SYS_GPE_MFPL_PE1MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE1MFP_Pos)
#define SYS_GPE_MFPL_PE1MFP_EMAC0_RMII_CRSDV  (0x01UL<<SYS_GPE_MFPL_PE1MFP_Pos)
#define SYS_GPE_MFPL_PE1MFP_CAN0_TXD          (0x02UL<<SYS_GPE_MFPL_PE1MFP_Pos)
#define SYS_GPE_MFPL_PE1MFP_UART4_nRTS        (0x05UL<<SYS_GPE_MFPL_PE1MFP_Pos)
#define SYS_GPE_MFPL_PE1MFP_SPI3_CLK          (0x06UL<<SYS_GPE_MFPL_PE1MFP_Pos)
#define SYS_GPE_MFPL_PE1MFP_I2C2_SMBSUS       (0x07UL<<SYS_GPE_MFPL_PE1MFP_Pos)

#define SYS_GPE_MFPL_PE2MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE2MFP_Pos)
#define SYS_GPE_MFPL_PE2MFP_EMAC0_RMII_RXD1   (0x01UL<<SYS_GPE_MFPL_PE2MFP_Pos)
#define SYS_GPE_MFPL_PE2MFP_CAN1_RXD          (0x02UL<<SYS_GPE_MFPL_PE2MFP_Pos)
#define SYS_GPE_MFPL_PE2MFP_UART4_RXD         (0x05UL<<SYS_GPE_MFPL_PE2MFP_Pos)
#define SYS_GPE_MFPL_PE2MFP_SPI3_MOSI         (0x06UL<<SYS_GPE_MFPL_PE2MFP_Pos)
#define SYS_GPE_MFPL_PE2MFP_I2C1_SMBAL        (0x07UL<<SYS_GPE_MFPL_PE2MFP_Pos)

#define SYS_GPE_MFPL_PE3MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE3MFP_Pos)
#define SYS_GPE_MFPL_PE3MFP_EMAC0_RMII_RXD0   (0x01UL<<SYS_GPE_MFPL_PE3MFP_Pos)
#define SYS_GPE_MFPL_PE3MFP_CAN1_TXD          (0x02UL<<SYS_GPE_MFPL_PE3MFP_Pos)
#define SYS_GPE_MFPL_PE3MFP_UART4_TXD         (0x05UL<<SYS_GPE_MFPL_PE3MFP_Pos)
#define SYS_GPE_MFPL_PE3MFP_SPI3_MISO         (0x06UL<<SYS_GPE_MFPL_PE3MFP_Pos)
#define SYS_GPE_MFPL_PE3MFP_I2C1_SMBSUS       (0x07UL<<SYS_GPE_MFPL_PE3MFP_Pos)

#define SYS_GPE_MFPL_PE4MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE4MFP_Pos)
#define SYS_GPE_MFPL_PE4MFP_EMAC0_RMII_REFCLK (0x01UL<<SYS_GPE_MFPL_PE4MFP_Pos)
#define SYS_GPE_MFPL_PE4MFP_CAN2_RXD          (0x02UL<<SYS_GPE_MFPL_PE4MFP_Pos)
#define SYS_GPE_MFPL_PE4MFP_UART9_nCTS        (0x05UL<<SYS_GPE_MFPL_PE4MFP_Pos)
#define SYS_GPE_MFPL_PE4MFP_I2C3_SMBAL        (0x07UL<<SYS_GPE_MFPL_PE4MFP_Pos)

#define SYS_GPE_MFPL_PE5MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE5MFP_Pos)
#define SYS_GPE_MFPL_PE5MFP_EMAC0_RMII_TXEN   (0x01UL<<SYS_GPE_MFPL_PE5MFP_Pos)
#define SYS_GPE_MFPL_PE5MFP_CAN2_TXD          (0x02UL<<SYS_GPE_MFPL_PE5MFP_Pos)
#define SYS_GPE_MFPL_PE5MFP_UART9_nRTS        (0x05UL<<SYS_GPE_MFPL_PE5MFP_Pos)
#define SYS_GPE_MFPL_PE5MFP_I2C3_SMBSUS       (0x07UL<<SYS_GPE_MFPL_PE5MFP_Pos)

#define SYS_GPE_MFPL_PE6MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE6MFP_Pos)
#define SYS_GPE_MFPL_PE6MFP_EMAC0_RMII_TXD1   (0x01UL<<SYS_GPE_MFPL_PE6MFP_Pos)
#define SYS_GPE_MFPL_PE6MFP_CAN3_RXD          (0x02UL<<SYS_GPE_MFPL_PE6MFP_Pos)
#define SYS_GPE_MFPL_PE6MFP_UART9_RXD         (0x05UL<<SYS_GPE_MFPL_PE6MFP_Pos)
#define SYS_GPE_MFPL_PE6MFP_I2C3_SMBAL        (0x07UL<<SYS_GPE_MFPL_PE6MFP_Pos)

#define SYS_GPE_MFPL_PE7MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE7MFP_Pos)
#define SYS_GPE_MFPL_PE7MFP_EMAC0_RMII_TXD0   (0x01UL<<SYS_GPE_MFPL_PE7MFP_Pos)
#define SYS_GPE_MFPL_PE7MFP_CAN3_TXD          (0x02UL<<SYS_GPE_MFPL_PE7MFP_Pos)
#define SYS_GPE_MFPL_PE7MFP_UART9_TXD         (0x05UL<<SYS_GPE_MFPL_PE7MFP_Pos)
#define SYS_GPE_MFPL_PE7MFP_I2C2_SMBSUS       (0x07UL<<SYS_GPE_MFPL_PE7MFP_Pos)

/********************* Bit definition of GPE_MFPH register **********************/
#define SYS_GPE_MFPH_PE8MFP_GPIO              (0x00UL<<SYS_GPE_MFPH_PE8MFP_Pos)
#define SYS_GPE_MFPH_PE8MFP_EMAC0_RMII_MDIO   (0x01UL<<SYS_GPE_MFPH_PE8MFP_Pos)
#define SYS_GPE_MFPH_PE8MFP_UART6_RXD         (0x05UL<<SYS_GPE_MFPH_PE8MFP_Pos)
#define SYS_GPE_MFPH_PE8MFP_I2C0_SMBAL        (0x07UL<<SYS_GPE_MFPH_PE8MFP_Pos)
#define SYS_GPE_MFPH_PE8MFP_SPI2_SS0          (0x08UL<<SYS_GPE_MFPH_PE8MFP_Pos)

#define SYS_GPE_MFPH_PE9MFP_GPIO              (0x00UL<<SYS_GPE_MFPH_PE9MFP_Pos)
#define SYS_GPE_MFPH_PE9MFP_EMAC0_RMII_MDC    (0x01UL<<SYS_GPE_MFPH_PE9MFP_Pos)
#define SYS_GPE_MFPH_PE9MFP_UART6_TXD         (0x05UL<<SYS_GPE_MFPH_PE9MFP_Pos)
#define SYS_GPE_MFPH_PE9MFP_I2C0_SMBSUS       (0x07UL<<SYS_GPE_MFPH_PE9MFP_Pos)
#define SYS_GPE_MFPH_PE9MFP_SPI2_CLK          (0x08UL<<SYS_GPE_MFPH_PE9MFP_Pos)

#define SYS_GPE_MFPH_PE10MFP_GPIO             (0x00UL<<SYS_GPE_MFPH_PE10MFP_Pos)
#define SYS_GPE_MFPH_PE10MFP_USB_OVC          (0x01UL<<SYS_GPE_MFPH_PE10MFP_Pos)
#define SYS_GPE_MFPH_PE10MFP_CAN3_RXD         (0x02UL<<SYS_GPE_MFPH_PE10MFP_Pos)
#define SYS_GPE_MFPH_PE10MFP_UART9_RXD        (0x03UL<<SYS_GPE_MFPH_PE10MFP_Pos)
#define SYS_GPE_MFPH_PE10MFP_BPWM1_CH2        (0x04UL<<SYS_GPE_MFPH_PE10MFP_Pos)
#define SYS_GPE_MFPH_PE10MFP_INT2             (0x05UL<<SYS_GPE_MFPH_PE10MFP_Pos)
#define SYS_GPE_MFPH_PE10MFP_I2C0_SDA         (0x06UL<<SYS_GPE_MFPH_PE10MFP_Pos)
#define SYS_GPE_MFPH_PE10MFP_SPI2_MOSI        (0x08UL<<SYS_GPE_MFPH_PE10MFP_Pos)

#define SYS_GPE_MFPH_PE11MFP_GPIO             (0x00UL<<SYS_GPE_MFPH_PE11MFP_Pos)
#define SYS_GPE_MFPH_PE11MFP_USB0_VBUSVLD     (0x01UL<<SYS_GPE_MFPH_PE11MFP_Pos)

#define SYS_GPE_MFPH_PE12MFP_GPIO             (0x00UL<<SYS_GPE_MFPH_PE12MFP_Pos)
#define SYS_GPE_MFPH_PE12MFP_USBH_PWREN       (0x01UL<<SYS_GPE_MFPH_PE12MFP_Pos)
#define SYS_GPE_MFPH_PE12MFP_CAN3_TXD         (0x02UL<<SYS_GPE_MFPH_PE12MFP_Pos)
#define SYS_GPE_MFPH_PE12MFP_UART9_TXD        (0x03UL<<SYS_GPE_MFPH_PE12MFP_Pos)
#define SYS_GPE_MFPH_PE12MFP_BPWM1_CH3        (0x04UL<<SYS_GPE_MFPH_PE12MFP_Pos)
#define SYS_GPE_MFPH_PE12MFP_INT3             (0x05UL<<SYS_GPE_MFPH_PE12MFP_Pos)
#define SYS_GPE_MFPH_PE12MFP_I2C0_SCL         (0x06UL<<SYS_GPE_MFPH_PE12MFP_Pos)
#define SYS_GPE_MFPH_PE12MFP_SPI2_MISO        (0x08UL<<SYS_GPE_MFPH_PE12MFP_Pos)

/********************* Bit definition of GPF_MFPL register **********************/
#define SYS_GPF_MFPL_PF0MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_EMAC1_RMII_RXERR  (0x01UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_SD1_CMD           (0x02UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_eMMC1_CMD         (0x02UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_SC1_RST           (0x04UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_UART7_nCTS        (0x05UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_SPI3_SS0          (0x06UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_BPWM1_CH5         (0x07UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_EBI_AD5           (0x08UL<<SYS_GPF_MFPL_PF0MFP_Pos)

#define SYS_GPF_MFPL_PF1MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_EMAC1_RMII_CRSDV  (0x01UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_SD1_CLK           (0x02UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_eMMC1_CLK         (0x02UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_SC1_CLK           (0x04UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_UART7_nRTS        (0x05UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_SPI3_CLK          (0x06UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_BPWM1_CH4         (0x07UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_EBI_AD6           (0x08UL<<SYS_GPF_MFPL_PF1MFP_Pos)

#define SYS_GPF_MFPL_PF2MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_EMAC1_RMII_RXD1   (0x01UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_SD1_DATA0         (0x02UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_eMMC1_DATA0       (0x02UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_SC1_DAT           (0x04UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_UART7_RXD         (0x05UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_SPI3_MOSI         (0x06UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_BPWM0_CH5         (0x07UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_EBI_AD7           (0x08UL<<SYS_GPF_MFPL_PF2MFP_Pos)

#define SYS_GPF_MFPL_PF3MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_EMAC1_RMII_RXD0   (0x01UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_SD1_DATA1         (0x02UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_eMMC1_DATA1       (0x02UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_SC1_PWR           (0x04UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_UART7_TXD         (0x05UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_SPI3_MISO         (0x06UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_BPWM0_CH4         (0x07UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_EBI_AD8           (0x08UL<<SYS_GPF_MFPL_PF3MFP_Pos)

#define SYS_GPF_MFPL_PF4MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_EMAC1_RMII_REFCLK (0x01UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_SD1_DATA2         (0x02UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_eMMC1_DATA2       (0x02UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_SC1_nCD           (0x04UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_UART3_nCTS        (0x05UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_SPI2_SS0          (0x07UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_EBI_AD9           (0x08UL<<SYS_GPF_MFPL_PF4MFP_Pos)

#define SYS_GPF_MFPL_PF5MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_EMAC1_RMII_TXEN   (0x01UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_SD1_DATA3         (0x02UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_eMMC1_DATA3       (0x02UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_BPWM0_CH0         (0x04UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_UART3_nRTS        (0x05UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_SPI2_CLK          (0x07UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_EBI_AD10          (0x08UL<<SYS_GPF_MFPL_PF5MFP_Pos)

#define SYS_GPF_MFPL_PF6MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_EMAC1_RMII_TXD1   (0x01UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_SD1_nCD           (0x02UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_TM4_EXT           (0x03UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_BPWM0_CH1         (0x04UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_UART3_RXD         (0x05UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_SPI2_MOSI         (0x07UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_EBI_AD11          (0x08UL<<SYS_GPF_MFPL_PF6MFP_Pos)

#define SYS_GPF_MFPL_PF7MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_EMAC1_RMII_TXD0   (0x01UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_UART1_nCTS        (0x02UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_TM5_EXT           (0x03UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_BPWM0_CH2         (0x04UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_UART3_TXD         (0x05UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_SPI2_MISO         (0x07UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_EBI_AD12          (0x08UL<<SYS_GPF_MFPL_PF7MFP_Pos)

/********************* Bit definition of GPF_MFPH register **********************/
#define SYS_GPF_MFPH_PF8MFP_GPIO              (0x00UL<<SYS_GPF_MFPH_PF8MFP_Pos)
#define SYS_GPF_MFPH_PF8MFP_EMAC1_RMII_MDIO   (0x01UL<<SYS_GPF_MFPH_PF8MFP_Pos)
#define SYS_GPF_MFPH_PF8MFP_UART1_nRTS        (0x02UL<<SYS_GPF_MFPH_PF8MFP_Pos)
#define SYS_GPF_MFPH_PF8MFP_TM1               (0x03UL<<SYS_GPF_MFPH_PF8MFP_Pos)
#define SYS_GPF_MFPH_PF8MFP_BPWM0_CH3         (0x04UL<<SYS_GPF_MFPH_PF8MFP_Pos)
#define SYS_GPF_MFPH_PF8MFP_SPI3_SS1          (0x06UL<<SYS_GPF_MFPH_PF8MFP_Pos)
#define SYS_GPF_MFPH_PF8MFP_EBI_AD13          (0x08UL<<SYS_GPF_MFPH_PF8MFP_Pos)

#define SYS_GPF_MFPH_PF9MFP_GPIO              (0x00UL<<SYS_GPF_MFPH_PF9MFP_Pos)
#define SYS_GPF_MFPH_PF9MFP_EMAC1_RMII_MDC    (0x01UL<<SYS_GPF_MFPH_PF9MFP_Pos)
#define SYS_GPF_MFPH_PF9MFP_UART1_RXD         (0x02UL<<SYS_GPF_MFPH_PF9MFP_Pos)
#define SYS_GPF_MFPH_PF9MFP_TM1_EXT           (0x03UL<<SYS_GPF_MFPH_PF9MFP_Pos)
#define SYS_GPF_MFPH_PF9MFP_BPWM1_CH0         (0x04UL<<SYS_GPF_MFPH_PF9MFP_Pos)
#define SYS_GPF_MFPH_PF9MFP_SPI3_SS0          (0x06UL<<SYS_GPF_MFPH_PF9MFP_Pos)
#define SYS_GPF_MFPH_PF9MFP_EBI_AD14          (0x08UL<<SYS_GPF_MFPH_PF9MFP_Pos)

#define SYS_GPF_MFPH_PF10MFP_GPIO             (0x00UL<<SYS_GPF_MFPH_PF10MFP_Pos)
#define SYS_GPF_MFPH_PF10MFP_EMAC0_RMII_PPS   (0x01UL<<SYS_GPF_MFPH_PF10MFP_Pos)
#define SYS_GPF_MFPH_PF10MFP_UART1_TXD        (0x02UL<<SYS_GPF_MFPH_PF10MFP_Pos)
#define SYS_GPF_MFPH_PF10MFP_TM5              (0x03UL<<SYS_GPF_MFPH_PF10MFP_Pos)
#define SYS_GPF_MFPH_PF10MFP_BPWM1_CH1        (0x04UL<<SYS_GPF_MFPH_PF10MFP_Pos)
#define SYS_GPF_MFPH_PF10MFP_CANFD3_TXD       (0x06UL<<SYS_GPF_MFPH_PF10MFP_Pos)
#define SYS_GPF_MFPH_PF10MFP_EBI_AD15         (0x08UL<<SYS_GPF_MFPH_PF10MFP_Pos)

#define SYS_GPF_MFPH_PF11MFP_GPIO             (0x00UL<<SYS_GPF_MFPH_PF11MFP_Pos)
#define SYS_GPF_MFPH_PF11MFP_UART0_RXD        (0x01UL<<SYS_GPF_MFPH_PF11MFP_Pos)

#define SYS_GPF_MFPH_PF12MFP_GPIO             (0x00UL<<SYS_GPF_MFPH_PF12MFP_Pos)
#define SYS_GPF_MFPH_PF12MFP_UART0_TXD        (0x01UL<<SYS_GPF_MFPH_PF12MFP_Pos)

/********************* Bit definition of GPG_MFPL register **********************/
#define SYS_GPG_MFPL_PG0MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG0MFP_Pos)
#define SYS_GPG_MFPL_PG0MFP_EBI_ADDR0         (0x01UL<<SYS_GPG_MFPL_PG0MFP_Pos)
#define SYS_GPG_MFPL_PG0MFP_UART2_RXD         (0x02UL<<SYS_GPG_MFPL_PG0MFP_Pos)
#define SYS_GPG_MFPL_PG0MFP_CLK_OUT           (0x03UL<<SYS_GPG_MFPL_PG0MFP_Pos)
#define SYS_GPG_MFPL_PG0MFP_CAN4_TXD          (0x05UL<<SYS_GPG_MFPL_PG0MFP_Pos)
#define SYS_GPG_MFPL_PG0MFP_BPWM0_CH0         (0x06UL<<SYS_GPG_MFPL_PG0MFP_Pos)

#define SYS_GPG_MFPL_PG1MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG1MFP_Pos)
#define SYS_GPG_MFPL_PG1MFP_EBI_ADDR1         (0x01UL<<SYS_GPG_MFPL_PG1MFP_Pos)
#define SYS_GPG_MFPL_PG1MFP_UART2_TXD         (0x02UL<<SYS_GPG_MFPL_PG1MFP_Pos)
#define SYS_GPG_MFPL_PG1MFP_CAN4_RXD          (0x05UL<<SYS_GPG_MFPL_PG1MFP_Pos)
#define SYS_GPG_MFPL_PG1MFP_BPWM0_CH1         (0x06UL<<SYS_GPG_MFPL_PG1MFP_Pos)

#define SYS_GPG_MFPL_PG2MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG2MFP_Pos)
#define SYS_GPG_MFPL_PG2MFP_EBI_ADDR2         (0x01UL<<SYS_GPG_MFPL_PG2MFP_Pos)
#define SYS_GPG_MFPL_PG2MFP_UART2_nCTS        (0x02UL<<SYS_GPG_MFPL_PG2MFP_Pos)
#define SYS_GPG_MFPL_PG2MFP_CANFD3_TXD        (0x04UL<<SYS_GPG_MFPL_PG2MFP_Pos)
#define SYS_GPG_MFPL_PG2MFP_BPWM0_CH2         (0x06UL<<SYS_GPG_MFPL_PG2MFP_Pos)

#define SYS_GPG_MFPL_PG3MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG3MFP_Pos)
#define SYS_GPG_MFPL_PG3MFP_EBI_ADDR3         (0x01UL<<SYS_GPG_MFPL_PG3MFP_Pos)
#define SYS_GPG_MFPL_PG3MFP_UART2_nRTS        (0x02UL<<SYS_GPG_MFPL_PG3MFP_Pos)
#define SYS_GPG_MFPL_PG3MFP_UART5_nCTS        (0x03UL<<SYS_GPG_MFPL_PG3MFP_Pos)
#define SYS_GPG_MFPL_PG3MFP_CAN5_TXD          (0x05UL<<SYS_GPG_MFPL_PG3MFP_Pos)
#define SYS_GPG_MFPL_PG3MFP_BPWM0_CH3         (0x06UL<<SYS_GPG_MFPL_PG3MFP_Pos)

#define SYS_GPG_MFPL_PG4MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG4MFP_Pos)
#define SYS_GPG_MFPL_PG4MFP_EBI_ADDR18        (0x01UL<<SYS_GPG_MFPL_PG4MFP_Pos)
#define SYS_GPG_MFPL_PG4MFP_UART5_nCTS        (0x02UL<<SYS_GPG_MFPL_PG4MFP_Pos)
#define SYS_GPG_MFPL_PG4MFP_CANFD3_RXD        (0x04UL<<SYS_GPG_MFPL_PG4MFP_Pos)

#define SYS_GPG_MFPL_PG5MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG5MFP_Pos)
#define SYS_GPG_MFPL_PG5MFP_EBI_ADDR12        (0x01UL<<SYS_GPG_MFPL_PG5MFP_Pos)
#define SYS_GPG_MFPL_PG5MFP_UART5_nRTS        (0x02UL<<SYS_GPG_MFPL_PG5MFP_Pos)
#define SYS_GPG_MFPL_PG5MFP_CAN5_RXD          (0x05UL<<SYS_GPG_MFPL_PG5MFP_Pos)

#define SYS_GPG_MFPL_PG6MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG6MFP_Pos)
#define SYS_GPG_MFPL_PG6MFP_EBI_ADDR4         (0x01UL<<SYS_GPG_MFPL_PG6MFP_Pos)
#define SYS_GPG_MFPH_PG6MFP_UART5_RXD         (0x02UL<<SYS_GPG_MFPL_PG6MFP_Pos)
#define SYS_GPG_MFPH_PG6MFP_CANFD1_TXD        (0x04UL<<SYS_GPG_MFPL_PG6MFP_Pos)
#define SYS_GPG_MFPH_PG6MFP_CAN7_TXD          (0x05UL<<SYS_GPG_MFPL_PG6MFP_Pos)
#define SYS_GPG_MFPH_PG6MFP_BPWM1_CH0         (0x06UL<<SYS_GPG_MFPL_PG6MFP_Pos)

#define SYS_GPG_MFPL_PG7MFP_GPIO              (0x00UL<<SYS_GPG_MFPL_PG7MFP_Pos)
#define SYS_GPG_MFPL_PG7MFP_EBI_ADDR5         (0x01UL<<SYS_GPG_MFPL_PG7MFP_Pos)
#define SYS_GPG_MFPH_PG7MFP_UART5_TXD         (0x02UL<<SYS_GPG_MFPL_PG7MFP_Pos)
#define SYS_GPG_MFPH_PG7MFP_CANFD1_RXD        (0x04UL<<SYS_GPG_MFPL_PG7MFP_Pos)
#define SYS_GPG_MFPH_PG7MFP_CAN7_RXD          (0x05UL<<SYS_GPG_MFPL_PG7MFP_Pos)
#define SYS_GPG_MFPH_PG7MFP_BPWM1_CH1         (0x06UL<<SYS_GPG_MFPL_PG7MFP_Pos)

/********************* Bit definition of GPG_MFPH register **********************/
#define SYS_GPG_MFPH_PG8MFP_GPIO              (0x00UL<<SYS_GPG_MFPH_PG8MFP_Pos)
#define SYS_GPG_MFPH_PG8MFP_EBI_ADDR6         (0x01UL<<SYS_GPG_MFPH_PG8MFP_Pos)
#define SYS_GPG_MFPH_PG8MFP_UART8_nRTS        (0x02UL<<SYS_GPG_MFPH_PG8MFP_Pos)
#define SYS_GPG_MFPH_PG8MFP_CANFD0_TXD        (0x04UL<<SYS_GPG_MFPH_PG8MFP_Pos)
#define SYS_GPG_MFPH_PG8MFP_CAN6_TXD          (0x05UL<<SYS_GPG_MFPH_PG8MFP_Pos)
#define SYS_GPG_MFPH_PG8MFP_BPWM1_CH2         (0x06UL<<SYS_GPG_MFPH_PG8MFP_Pos)

#define SYS_GPG_MFPH_PG9MFP_GPIO              (0x00UL<<SYS_GPG_MFPH_PG9MFP_Pos)
#define SYS_GPG_MFPH_PG9MFP_EBI_ADDR7         (0x01UL<<SYS_GPG_MFPH_PG9MFP_Pos)
#define SYS_GPG_MFPH_PG9MFP_UART8_nCTS        (0x02UL<<SYS_GPG_MFPH_PG9MFP_Pos)
#define SYS_GPG_MFPH_PG9MFP_CANFD0_RXD        (0x04UL<<SYS_GPG_MFPH_PG9MFP_Pos)
#define SYS_GPG_MFPH_PG9MFP_CAN6_RXD          (0x05UL<<SYS_GPG_MFPH_PG9MFP_Pos)
#define SYS_GPG_MFPH_PG9MFP_BPWM1_CH3         (0x06UL<<SYS_GPG_MFPH_PG9MFP_Pos)

#define SYS_GPG_MFPH_PG10MFP_GPIO             (0x00UL<<SYS_GPG_MFPH_PG10MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_EBI_AD0          (0x01UL<<SYS_GPG_MFPH_PG10MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_I2C0_SCL         (0x02UL<<SYS_GPG_MFPH_PG10MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_TM5              (0x03UL<<SYS_GPG_MFPH_PG10MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_CAN2_TXD         (0x05UL<<SYS_GPG_MFPH_PG10MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_SPI1_CLK         (0x06UL<<SYS_GPG_MFPH_PG10MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_BPWM0_CH0        (0x07UL<<SYS_GPG_MFPH_PG10MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_I2S_BCLK         (0x08UL<<SYS_GPG_MFPH_PG10MFP_Pos)

#define SYS_GPG_MFPH_PG11MFP_GPIO             (0x00UL<<SYS_GPG_MFPH_PG11MFP_Pos)
#define SYS_GPG_MFPH_PG11MFP_SPI1_SS0         (0x02UL<<SYS_GPG_MFPH_PG11MFP_Pos)
#define SYS_GPG_MFPH_PG11MFP_TM1              (0x03UL<<SYS_GPG_MFPH_PG11MFP_Pos)
#define SYS_GPG_MFPH_PG11MFP_CAN0_RXD         (0x04UL<<SYS_GPG_MFPH_PG11MFP_Pos)
#define SYS_GPG_MFPH_PG11MFP_UART5_nCTS       (0x05UL<<SYS_GPG_MFPH_PG11MFP_Pos)
#define SYS_GPG_MFPH_PG11MFP_BPMW1_CH0        (0x06UL<<SYS_GPG_MFPH_PG11MFP_Pos)
#define SYS_GPG_MFPH_PG11MFP_JTAG0_TDO        (0x07UL<<SYS_GPG_MFPH_PG11MFP_Pos)
#define SYS_GPG_MFPH_PG11MFP_I2C2_SMBAL       (0x08UL<<SYS_GPG_MFPH_PG11MFP_Pos)

#define SYS_GPG_MFPH_PG12MFP_GPIO             (0x00UL<<SYS_GPG_MFPH_PG12MFP_Pos)
#define SYS_GPG_MFPH_PG12MFP_SPI1_CLK         (0x02UL<<SYS_GPG_MFPH_PG12MFP_Pos)
#define SYS_GPG_MFPH_PG12MFP_TM1_EXT          (0x03UL<<SYS_GPG_MFPH_PG12MFP_Pos)
#define SYS_GPG_MFPH_PG12MFP_CAN0_TXD         (0x04UL<<SYS_GPG_MFPH_PG12MFP_Pos)
#define SYS_GPG_MFPH_PG12MFP_UART5_nRTS       (0x05UL<<SYS_GPG_MFPH_PG12MFP_Pos)
#define SYS_GPG_MFPH_PG12MFP_BPMW1_CH1        (0x06UL<<SYS_GPG_MFPH_PG12MFP_Pos)
#define SYS_GPG_MFPH_PG12MFP_JTAG0_TCK        (0x07UL<<SYS_GPG_MFPH_PG12MFP_Pos)
#define SYS_GPG_MFPH_PG12MFP_I2C2_SMBBUS      (0x08UL<<SYS_GPG_MFPH_PG12MFP_Pos)

#define SYS_GPG_MFPH_PG13MFP_GPIO             (0x00UL<<SYS_GPG_MFPH_PG13MFP_Pos)
#define SYS_GPG_MFPH_PG13MFP_SPI1_MOSI        (0x02UL<<SYS_GPG_MFPH_PG13MFP_Pos)
#define SYS_GPG_MFPH_PG13MFP_CAN1_RXD         (0x04UL<<SYS_GPG_MFPH_PG13MFP_Pos)
#define SYS_GPG_MFPH_PG13MFP_UART5_RXD        (0x05UL<<SYS_GPG_MFPH_PG13MFP_Pos)
#define SYS_GPG_MFPH_PG13MFP_BPMW1_CH2        (0x06UL<<SYS_GPG_MFPH_PG13MFP_Pos)
#define SYS_GPG_MFPH_PG13MFP_JTAG0_TMS        (0x07UL<<SYS_GPG_MFPH_PG13MFP_Pos)
#define SYS_GPG_MFPH_PG13MFP_I2C3_SMBAL       (0x08UL<<SYS_GPG_MFPH_PG13MFP_Pos)

#define SYS_GPG_MFPH_PG14MFP_GPIO             (0x00UL<<SYS_GPG_MFPH_PG14MFP_Pos)
#define SYS_GPG_MFPH_PG14MFP_SPI1_MISO        (0x02UL<<SYS_GPG_MFPH_PG14MFP_Pos)
#define SYS_GPG_MFPH_PG14MFP_CAN1_TXD         (0x04UL<<SYS_GPG_MFPH_PG14MFP_Pos)
#define SYS_GPG_MFPH_PG14MFP_UART5_TXD        (0x05UL<<SYS_GPG_MFPH_PG14MFP_Pos)
#define SYS_GPG_MFPH_PG14MFP_BPMW1_CH3        (0x06UL<<SYS_GPG_MFPH_PG14MFP_Pos)
#define SYS_GPG_MFPH_PG14MFP_JTAG0_TDI        (0x07UL<<SYS_GPG_MFPH_PG14MFP_Pos)
#define SYS_GPG_MFPH_PG14MFP_I2C3_SMBSUS      (0x08UL<<SYS_GPG_MFPH_PG14MFP_Pos)

#define SYS_GPG_MFPH_PG15MFP_GPIO             (0x00UL<<SYS_GPG_MFPH_PG15MFP_Pos)
#define SYS_GPG_MFPH_PG15MFP_SPI0_SS1         (0x01UL<<SYS_GPG_MFPH_PG15MFP_Pos)
#define SYS_GPG_MFPH_PG15MFP_SPI1_SS1         (0x02UL<<SYS_GPG_MFPH_PG15MFP_Pos)
#define SYS_GPG_MFPH_PG15MFP_INT3             (0x04UL<<SYS_GPG_MFPH_PG15MFP_Pos)
#define SYS_GPG_MFPH_PG15MFP_SPI2_SS1         (0x05UL<<SYS_GPG_MFPH_PG15MFP_Pos)
#define SYS_GPG_MFPH_PG15MFP_CANFD3_RXD       (0x06UL<<SYS_GPG_MFPH_PG15MFP_Pos)
#define SYS_GPG_MFPH_PG15MFP_JTAG0_nTRST      (0x07UL<<SYS_GPG_MFPH_PG15MFP_Pos)
#define SYS_GPG_MFPH_PG15MFP_SPI3_SS1         (0x08UL<<SYS_GPG_MFPH_PG15MFP_Pos)

/********************* Bit definition of GPH_MFPL register **********************/
#define SYS_GPH_MFPL_PH0MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH0MFP_Pos)
#define SYS_GPH_MFPL_PH0MFP_UART1_TXD         (0x01UL<<SYS_GPH_MFPL_PH0MFP_Pos)
#define SYS_GPH_MFPL_PH0MFP_UART2_nCTS        (0x02UL<<SYS_GPH_MFPL_PH0MFP_Pos)
#define SYS_GPH_MFPL_PH0MFP_INT0              (0x04UL<<SYS_GPH_MFPL_PH0MFP_Pos)
#define SYS_GPH_MFPL_PH0MFP_SPI0_SS0          (0x05UL<<SYS_GPH_MFPL_PH0MFP_Pos)
#define SYS_GPH_MFPL_PH0MFP_SD0_nCD           (0x06UL<<SYS_GPH_MFPL_PH0MFP_Pos)

