yenchouRJ/nuc990_non-os/Library/StdDriver/inc/sys.h
#define SYS_GPH_MFPL_PH1MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH1MFP_Pos)
#define SYS_GPH_MFPL_PH1MFP_UART1_RXD         (0x01UL<<SYS_GPH_MFPL_PH1MFP_Pos)
#define SYS_GPH_MFPL_PH1MFP_UART2_nRTS        (0x02UL<<SYS_GPH_MFPL_PH1MFP_Pos)
#define SYS_GPH_MFPL_PH1MFP_TM3               (0x03UL<<SYS_GPH_MFPL_PH1MFP_Pos)
#define SYS_GPH_MFPL_PH1MFP_SD0_DATA0         (0x06UL<<SYS_GPH_MFPL_PH1MFP_Pos)
#define SYS_GPH_MFPL_PH1MFP_eMMC0_DATA0       (0x06UL<<SYS_GPH_MFPL_PH1MFP_Pos)

#define SYS_GPH_MFPL_PH2MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH2MFP_Pos)
#define SYS_GPH_MFPL_PH2MFP_UART1_nRTS        (0x01UL<<SYS_GPH_MFPL_PH2MFP_Pos)
#define SYS_GPH_MFPL_PH2MFP_CAN3_RXD          (0x02UL<<SYS_GPH_MFPL_PH2MFP_Pos)
#define SYS_GPH_MFPL_PH2MFP_TM3_EXT           (0x03UL<<SYS_GPH_MFPL_PH2MFP_Pos)
#define SYS_GPH_MFPL_PH2MFP_SD0_DATA1         (0x06UL<<SYS_GPH_MFPL_PH2MFP_Pos)
#define SYS_GPH_MFPL_PH2MFP_eMMC0_DATA1       (0x06UL<<SYS_GPH_MFPL_PH2MFP_Pos)

#define SYS_GPH_MFPL_PH3MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH3MFP_Pos)
#define SYS_GPH_MFPL_PH3MFP_UART1_nCTS        (0x01UL<<SYS_GPH_MFPL_PH3MFP_Pos)
#define SYS_GPH_MFPL_PH3MFP_CAN3_TXD          (0x02UL<<SYS_GPH_MFPL_PH3MFP_Pos)
#define SYS_GPH_MFPL_PH3MFP_I2C3_SDA          (0x03UL<<SYS_GPH_MFPL_PH3MFP_Pos)
#define SYS_GPH_MFPL_PH3MFP_SD0_DATA2         (0x06UL<<SYS_GPH_MFPL_PH3MFP_Pos)
#define SYS_GPH_MFPL_PH3MFP_eMMC0_DATA2       (0x06UL<<SYS_GPH_MFPL_PH3MFP_Pos)

#define SYS_GPH_MFPL_PH4MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH4MFP_Pos)
#define SYS_GPH_MFPL_PH4MFP_UART9_TXD         (0x01UL<<SYS_GPH_MFPL_PH4MFP_Pos)
#define SYS_GPH_MFPL_PH4MFP_UART8_nCTS        (0x02UL<<SYS_GPH_MFPL_PH4MFP_Pos)
#define SYS_GPH_MFPL_PH4MFP_I2C3_SCL          (0x03UL<<SYS_GPH_MFPL_PH4MFP_Pos)
#define SYS_GPH_MFPL_PH4MFP_SD0_DATA3         (0x06UL<<SYS_GPH_MFPL_PH4MFP_Pos)
#define SYS_GPH_MFPL_PH4MFP_eMMC0_DATA3       (0x06UL<<SYS_GPH_MFPL_PH4MFP_Pos)

#define SYS_GPH_MFPL_PH5MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH5MFP_Pos)
#define SYS_GPH_MFPL_PH5MFP_UART9_RXD         (0x01UL<<SYS_GPH_MFPL_PH5MFP_Pos)
#define SYS_GPH_MFPL_PH5MFP_UART8_nRTS        (0x02UL<<SYS_GPH_MFPL_PH5MFP_Pos)
#define SYS_GPH_MFPL_PH5MFP_INT1              (0x04UL<<SYS_GPH_MFPL_PH5MFP_Pos)
#define SYS_GPH_MFPL_PH5MFP_SPI0_MISO         (0x05UL<<SYS_GPH_MFPL_PH5MFP_Pos)
#define SYS_GPH_MFPL_PH5MFP_SD0_CMD           (0x06UL<<SYS_GPH_MFPL_PH5MFP_Pos)
#define SYS_GPH_MFPL_PH5MFP_eMMC0_CMD         (0x06UL<<SYS_GPH_MFPL_PH5MFP_Pos)

#define SYS_GPH_MFPL_PH6MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH6MFP_Pos)
#define SYS_GPH_MFPL_PH6MFP_UART9_nRTS        (0x01UL<<SYS_GPH_MFPL_PH6MFP_Pos)
#define SYS_GPH_MFPL_PH6MFP_CAN4_RXD          (0x02UL<<SYS_GPH_MFPL_PH6MFP_Pos)
#define SYS_GPH_MFPL_PH6MFP_SPI0_CLK          (0x05UL<<SYS_GPH_MFPL_PH6MFP_Pos)
#define SYS_GPH_MFPL_PH6MFP_SD0_CLK           (0x06UL<<SYS_GPH_MFPL_PH6MFP_Pos)
#define SYS_GPH_MFPL_PH6MFP_eMMC0_CLK         (0x06UL<<SYS_GPH_MFPL_PH6MFP_Pos)

#define SYS_GPH_MFPL_PH7MFP_GPIO              (0x00UL<<SYS_GPH_MFPL_PH7MFP_Pos)
#define SYS_GPH_MFPL_PH7MFP_UART9_nCTS        (0x01UL<<SYS_GPH_MFPL_PH7MFP_Pos)
#define SYS_GPH_MFPL_PH7MFP_CAN4_TXD          (0x02UL<<SYS_GPH_MFPL_PH7MFP_Pos)
#define SYS_GPH_MFPL_PH7MFP_I2C2_SDA          (0x03UL<<SYS_GPH_MFPL_PH7MFP_Pos)
#define SYS_GPH_MFPL_PH7MFP_INT1              (0x04UL<<SYS_GPH_MFPL_PH7MFP_Pos)
#define SYS_GPH_MFPL_PH7MFP_SPI1_SS1          (0x05UL<<SYS_GPH_MFPL_PH7MFP_Pos)
#define SYS_GPH_MFPL_PH7MFP_SD1_nCD           (0x06UL<<SYS_GPH_MFPL_PH7MFP_Pos)

/********************* Bit definition of GPH_MFPH register **********************/
#define SYS_GPH_MFPH_PH8MFP_GPIO              (0x00UL<<SYS_GPH_MFPH_PH8MFP_Pos)
#define SYS_GPH_MFPH_PH8MFP_UART2_TXD         (0x01UL<<SYS_GPH_MFPH_PH8MFP_Pos)
#define SYS_GPH_MFPH_PH8MFP_UART6_nCTS        (0x02UL<<SYS_GPH_MFPH_PH8MFP_Pos)
#define SYS_GPH_MFPH_PH8MFP_I2C2_SCL          (0x03UL<<SYS_GPH_MFPH_PH8MFP_Pos)
#define SYS_GPH_MFPH_PH8MFP_INT0              (0x04UL<<SYS_GPH_MFPH_PH8MFP_Pos)
#define SYS_GPH_MFPH_PH8MFP_SD1_CMD           (0x06UL<<SYS_GPH_MFPH_PH8MFP_Pos)
#define SYS_GPH_MFPH_PH8MFP_eMMC1_CMD         (0x06UL<<SYS_GPH_MFPH_PH8MFP_Pos)

#define SYS_GPH_MFPH_PH9MFP_GPIO              (0x00UL<<SYS_GPH_MFPH_PH9MFP_Pos)
#define SYS_GPH_MFPH_PH9MFP_UART2_RXD         (0x01UL<<SYS_GPH_MFPH_PH9MFP_Pos)
#define SYS_GPH_MFPH_PH9MFP_UART6_nRTS        (0x02UL<<SYS_GPH_MFPH_PH9MFP_Pos)
#define SYS_GPH_MFPH_PH9MFP_SD1_CLK           (0x06UL<<SYS_GPH_MFPH_PH9MFP_Pos)
#define SYS_GPH_MFPH_PH9MFP_eMMC1_CLK         (0x06UL<<SYS_GPH_MFPH_PH9MFP_Pos)

/*! @}*/ /* end of group SYS_EXPORTED_CONSTANTS */



#if 1  // temporarily ..... for compatibility with the original test code


#define SYS_GPA_MFPL_PA1MFP_EBI_nCS2          (0x01UL<<SYS_GPA_MFPL_PA1MFP_Pos)
#define SYS_GPA_MFPL_PA1MFP_EBI_MCLK          (0x02UL<<SYS_GPA_MFPL_PA1MFP_Pos)
#define SYS_GPA_MFPL_PA6MFP_EBI_nCS1          (0x01UL<<SYS_GPA_MFPL_PA6MFP_Pos)
#define SYS_GPA_MFPL_PA7MFP_EBI_nWE           (0x01UL<<SYS_GPA_MFPL_PA7MFP_Pos)
#define SYS_GPA_MFPH_PA8MFP_EBI_nRE           (0x01UL<<SYS_GPA_MFPH_PA8MFP_Pos)
#define SYS_GPA_MFPH_PA9MFP_EBI_nCS0          (0x01UL<<SYS_GPA_MFPH_PA9MFP_Pos)
#define SYS_GPA_MFPH_PA10MFP_EBI_ADDR10       (0x01UL<<SYS_GPA_MFPH_PA10MFP_Pos)
#define SYS_GPA_MFPH_PA11MFP_EBI_ADDR9        (0x01UL<<SYS_GPA_MFPH_PA11MFP_Pos)
#define SYS_GPA_MFPH_PA12MFP_EBI_ADDR8        (0x01UL<<SYS_GPA_MFPH_PA12MFP_Pos)
#define SYS_GPA_MFPH_PA13MFP_EBI_ADDR13       (0x01UL<<SYS_GPA_MFPH_PA13MFP_Pos)
#define SYS_GPA_MFPH_PA14MFP_EBI_ADDR14       (0x01UL<<SYS_GPA_MFPH_PA14MFP_Pos)
#define SYS_GPA_MFPH_PA15MFP_EBI_ADDR19       (0x01UL<<SYS_GPA_MFPH_PA15MFP_Pos)
#define SYS_GPB_MFPL_PB0MFP_EBI_ADDR12        (0x01UL<<SYS_GPB_MFPL_PB0MFP_Pos)
#define SYS_GPB_MFPL_PB1MFP_EBI_ADDR17        (0x01UL<<SYS_GPB_MFPL_PB1MFP_Pos)
#define SYS_GPB_MFPL_PB2MFP_EBI_ADDR2         (0x01UL<<SYS_GPB_MFPL_PB2MFP_Pos)
#define SYS_GPB_MFPL_PB2MFP_EBI_MCLK          (0x03UL<<SYS_GPB_MFPL_PB2MFP_Pos)
#define SYS_GPB_MFPL_PB3MFP_EBI_ADDR18        (0x01UL<<SYS_GPB_MFPL_PB3MFP_Pos)
#define SYS_GPB_MFPL_PB4MFP_EBI_ADDR14        (0x01UL<<SYS_GPB_MFPL_PB4MFP_Pos)
#define SYS_GPB_MFPL_PB5MFP_EBI_ADDR16        (0x01UL<<SYS_GPB_MFPL_PB5MFP_Pos)
#define SYS_GPB_MFPL_PB6MFP_EBI_ADDR13        (0x01UL<<SYS_GPB_MFPL_PB6MFP_Pos)
#define SYS_GPB_MFPL_PB7MFP_EBI_ADDR15        (0x01UL<<SYS_GPB_MFPL_PB7MFP_Pos)
#define SYS_GPB_MFPH_PB8MFP_EBI_ADDR11        (0x01UL<<SYS_GPB_MFPH_PB8MFP_Pos)
#define SYS_GPC_MFPL_PC0MFP_EBI_DATA0         (0x01UL<<SYS_GPC_MFPL_PC0MFP_Pos)
#define SYS_GPC_MFPL_PC1MFP_EBI_DATA1         (0x01UL<<SYS_GPC_MFPL_PC1MFP_Pos)
#define SYS_GPC_MFPL_PC2MFP_EBI_DATA2         (0x01UL<<SYS_GPC_MFPL_PC2MFP_Pos)
#define SYS_GPC_MFPL_PC3MFP_EBI_DATA3         (0x01UL<<SYS_GPC_MFPL_PC3MFP_Pos)
#define SYS_GPC_MFPL_PC4MFP_EBI_DATA4         (0x01UL<<SYS_GPC_MFPL_PC4MFP_Pos)
#define SYS_GPC_MFPL_PC5MFP_EBI_DATA5         (0x01UL<<SYS_GPC_MFPL_PC5MFP_Pos)
#define SYS_GPC_MFPL_PC6MFP_EBI_DATA6         (0x01UL<<SYS_GPC_MFPL_PC6MFP_Pos)
#define SYS_GPC_MFPL_PC7MFP_EBI_DATA7         (0x01UL<<SYS_GPC_MFPL_PC7MFP_Pos)
#define SYS_GPC_MFPH_PC8MFP_EBI_DATA8         (0x01UL<<SYS_GPC_MFPH_PC8MFP_Pos)
#define SYS_GPC_MFPH_PC9MFP_EBI_DATA9         (0x01UL<<SYS_GPC_MFPH_PC9MFP_Pos)
#define SYS_GPC_MFPH_PC10MFP_EBI_DATA10       (0x01UL<<SYS_GPC_MFPH_PC10MFP_Pos)
#define SYS_GPC_MFPH_PC11MFP_EBI_DATA11       (0x01UL<<SYS_GPC_MFPH_PC11MFP_Pos)
#define SYS_GPC_MFPH_PC12MFP_EBI_DATA12       (0x01UL<<SYS_GPC_MFPH_PC12MFP_Pos)
#define SYS_GPC_MFPH_PC13MFP_EBI_DATA13       (0x01UL<<SYS_GPC_MFPH_PC13MFP_Pos)
#define SYS_GPC_MFPH_PC14MFP_EBI_DATA14       (0x01UL<<SYS_GPC_MFPH_PC14MFP_Pos)
#define SYS_GPC_MFPH_PC15MFP_EBI_DATA15       (0x01UL<<SYS_GPC_MFPH_PC15MFP_Pos)
#define SYS_GPD_MFPH_PD12MFP_EBI_DATA1        (0x08UL<<SYS_GPD_MFPH_PD12MFP_Pos)
#define SYS_GPD_MFPH_PD13MFP_EBI_DATA2        (0x08UL<<SYS_GPD_MFPH_PD13MFP_Pos)
#define SYS_GPD_MFPH_PD14MFP_EBI_DATA3        (0x08UL<<SYS_GPD_MFPH_PD14MFP_Pos)
#define SYS_GPD_MFPH_PD15MFP_EBI_DATA4        (0x08UL<<SYS_GPD_MFPH_PD15MFP_Pos)
#define SYS_GPF_MFPL_PF0MFP_EBI_DATA5         (0x08UL<<SYS_GPF_MFPL_PF0MFP_Pos)
#define SYS_GPF_MFPL_PF1MFP_EBI_DATA6         (0x08UL<<SYS_GPF_MFPL_PF1MFP_Pos)
#define SYS_GPF_MFPL_PF2MFP_EBI_DATA7         (0x08UL<<SYS_GPF_MFPL_PF2MFP_Pos)
#define SYS_GPF_MFPL_PF3MFP_EBI_DATA8         (0x08UL<<SYS_GPF_MFPL_PF3MFP_Pos)
#define SYS_GPF_MFPL_PF4MFP_EBI_DATA9         (0x08UL<<SYS_GPF_MFPL_PF4MFP_Pos)
#define SYS_GPF_MFPL_PF5MFP_EBI_DATA10        (0x08UL<<SYS_GPF_MFPL_PF5MFP_Pos)
#define SYS_GPF_MFPL_PF6MFP_EBI_DATA11        (0x08UL<<SYS_GPF_MFPL_PF6MFP_Pos)
#define SYS_GPF_MFPL_PF7MFP_EBI_DATA12        (0x08UL<<SYS_GPF_MFPL_PF7MFP_Pos)
#define SYS_GPF_MFPH_PF8MFP_EBI_DATA13        (0x08UL<<SYS_GPF_MFPH_PF8MFP_Pos)
#define SYS_GPF_MFPH_PF9MFP_EBI_DATA14        (0x08UL<<SYS_GPF_MFPH_PF9MFP_Pos)
#define SYS_GPF_MFPH_PF10MFP_EBI_DATA15       (0x08UL<<SYS_GPF_MFPH_PF10MFP_Pos)
#define SYS_GPG_MFPL_PG0MFP_EBI_ADDR0         (0x01UL<<SYS_GPG_MFPL_PG0MFP_Pos)
#define SYS_GPG_MFPL_PG1MFP_EBI_ADDR1         (0x01UL<<SYS_GPG_MFPL_PG1MFP_Pos)
#define SYS_GPG_MFPL_PG2MFP_EBI_ADDR2         (0x01UL<<SYS_GPG_MFPL_PG2MFP_Pos)
#define SYS_GPG_MFPL_PG3MFP_EBI_ADDR3         (0x01UL<<SYS_GPG_MFPL_PG3MFP_Pos)
#define SYS_GPG_MFPL_PG4MFP_EBI_ADDR18        (0x01UL<<SYS_GPG_MFPL_PG4MFP_Pos)
#define SYS_GPG_MFPL_PG5MFP_EBI_ADDR12        (0x01UL<<SYS_GPG_MFPL_PG5MFP_Pos)
#define SYS_GPG_MFPL_PG6MFP_EBI_ADDR4         (0x01UL<<SYS_GPG_MFPL_PG6MFP_Pos)
#define SYS_GPG_MFPL_PG7MFP_EBI_ADDR5         (0x01UL<<SYS_GPG_MFPL_PG7MFP_Pos)
#define SYS_GPG_MFPH_PG8MFP_EBI_ADDR6         (0x01UL<<SYS_GPG_MFPH_PG8MFP_Pos)
#define SYS_GPG_MFPH_PG9MFP_EBI_ADDR7         (0x01UL<<SYS_GPG_MFPH_PG9MFP_Pos)
#define SYS_GPG_MFPH_PG10MFP_EBI_DATA0        (0x01UL<<SYS_GPG_MFPH_PG10MFP_Pos)

#define SYS_GPA_MFPH_PA14MFP_TM1              (0x01UL<<SYS_GPA_MFPH_PA14MFP_Pos)

#endif

