yenchouRJ/nuc990_non-os/Library/StdDriver/inc/sys.h
/** @addtogroup SYS_EXPORTED_FUNCTIONS SYS Exported Functions
  @{
*/

/*---------------------------------------------------------------------------------------------------------*/
/* static inline functions                                                                                 */
/*---------------------------------------------------------------------------------------------------------*/

/* Declare these inline functions here to avoid MISRA C 2004 rule 8.1 error */
static __inline void SYS_UnlockReg(void);
static __inline void SYS_LockReg(void);
static __inline void Reset_SPI(void);

/**
  * @brief      Disable register write-protection function
  * @param      None
  * @return     None
  * @details    This function disable register write-protection function.
  *             To unlock the protected register to allow write access.
  */
static __inline void SYS_UnlockReg(void)
{
    do
    {
		SYS->REGLKCTL = 0x59UL;
		SYS->REGLKCTL = 0x16UL;
		SYS->REGLKCTL = 0x88UL;
    }
    while(SYS->REGLKCTL == 0UL);
}

/**
  * @brief      Enable register write-protection function
  * @param      None
  * @return     None
  * @details    This function is used to enable register write-protection function.
  *             To lock the protected register to forbid write access.
  */
static __inline void SYS_LockReg(void)
{
    SYS->REGLKCTL = 0UL;
}

// TODO .....
//Reset SPI0/1/2
static __inline void Reset_SPI(void)
{
    SYS->APBIPRST1 |= 0x00000070;
    SYS->APBIPRST1 &= (~0x00000070);
}

/* Define system library AIC functions */
BOOL    sysGetIBitState(void);
INT32   sysSetLocalInterrupt(INT32 nIntState);
INT32   sysDisableInterrupt(IRQn_Type eIntNo);
INT32   sysEnableInterrupt(IRQn_Type eIntNo);
INT32   sysGetIEStatus(IRQn_Type eIntNo);
UINT32  sysGetInterruptEnableStatus(void);
UINT32  sysGetInterruptEnableStatusH(void);
PVOID   sysInstallExceptionHandler(INT32 nExceptType, PVOID pvNewHandler);
PVOID   sysInstallFiqHandler(PVOID pvNewISR);
PVOID   sysInstallIrqHandler(PVOID pvNewISR);
PVOID   sysInstallISR(INT32 nIntTypeLevel, IRQn_Type eIntNo, PVOID pvNewISR);
INT32   sysSetGlobalInterrupt(INT32 nIntState);
INT32   sysSetInterruptPriorityLevel(IRQn_Type eIntNo, UINT32 uIntLevel);

#ifdef _POWER_MANAGEMENT_
void sysEnterPowerDown(void);
void sysEnterIdle(void);
#endif

void sysResetModule(uint32_t u32ModuleIndex);

/* Define system library Cache functions */
void    sysDisableCache(void);
INT32   sysEnableCache(UINT32 uCacheOpMode);
void    sysFlushCache(INT32 nCacheType);
BOOL    sysGetCacheState(void);
INT32   sysGetSdramSizebyMB(void);
void    sysInvalidCache(void);

INT32 sysGetPLL(UINT32 reg);
UINT32 sysGetClock(CLK_Type clk);

void sysCleanInvalidatedDcache(UINT32 buffer, UINT32 size);
void sysCleanDcache(UINT32 buffer, UINT32 size);
void sysInvalidateDcache(UINT32 buffer, UINT32 size);
void sysInvalidateDcacheAll(void);

int kbhit(void);
int recvchar(void);
int sysGetChar(void);
int sendchar(int ch);

typedef void (*sys_pvFunPtr)();   /* function pointer */

extern sys_pvFunPtr IrqHandlerTable[];
extern sys_pvFunPtr FiqHandlerTable[];
extern UINT32 volatile _sys_bIsAICInitial;

#if defined ( __GNUC__ ) && !(__CC_ARM)
void __wfi(void);
#else
__asm void __wfi(void);
#endif


#ifdef __cplusplus
}
#endif

/*@}*/ /* end of group SYS_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group SYS_Driver */

/*@}*/ /* end of group Standard_Driver */

#endif //__SYS_H__

/*** (C) COPYRIGHT 2025 Nuvoton Technology Corp. ***/
